12/data/attachments/8a84b7244ca32ee7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Christopher_level_Friend_50946_2</nif:username>
            <nif:friendToBeRequested>soap_friends_6cf6109e-6903-4532-a6c8-84eaf49ac264</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>